import { Product } from "@/interfaces/product";

const pdts: Product[] = [
  {
    name: "发动机",
    sellPrices: {
      修格里城: null,
      铁盟哨站: 3464,
      七号自由港: 3665,
      澄明数据中心: 3565,
      阿妮塔战备工厂: 3589,
      阿妮塔能源研究所: 3968,
      荒原站: 3565,
      曼德矿场: 3565,
      淘金乐园: 3767,
    },
    buyPrices: {
      修格里城: 3363,
    },
    buyLot: {
      修格里城: 9,
    },
    type: "Special",
  },
  {
    name: "弹丸加速装置",
    sellPrices: {
      修格里城: null,
      铁盟哨站: null,
      七号自由港: 2383,
      澄明数据中心: 2297,
      阿妮塔战备工厂: 2448,
      阿妮塔能源研究所: 2555,
      荒原站: 2297,
      曼德矿场: 2296,
      淘金乐园: 2448,
    },
    buyPrices: {
      修格里城: 2147,
      铁盟哨站: 2067,
    },
    buyLot: {
      修格里城: 18,
      铁盟哨站: 12,
    },
    type: "Special",
  },
  {
    name: "红茶",
    sellPrices: {
      修格里城: null,
      铁盟哨站: 709,
      七号自由港: 873,
      澄明数据中心: 790,
      阿妮塔战备工厂: 873,
      阿妮塔能源研究所: 1039,
      荒原站: 790,
      曼德矿场: 791,
      淘金乐园: 873,
    },
    buyPrices: {
      修格里城: 688,
    },
    buyLot: {
      修格里城: 29,
    },
    type: "Special",
  },
  {
    name: "沃德烤鸡",
    sellPrices: {
      修格里城: null,
      铁盟哨站: 316,
      七号自由港: 464,
      澄明数据中心: 381.3,
      阿妮塔战备工厂: 456,
      阿妮塔能源研究所: 613,
      荒原站: 381,
      曼德矿场: 390,
      淘金乐园: 464,
    },
    buyPrices: {
      修格里城: 300,
    },
    buyLot: {
      修格里城: 39,
    },
    type: "Special",
  },
  {
    name: "防弹背心",
    sellPrices: {
      修格里城: 2933,
      铁盟哨站: null,
      七号自由港: 3359,
      澄明数据中心: 3132,
      阿妮塔战备工厂: 3245,
      阿妮塔能源研究所: 3586,
      荒原站: 2932,
      曼德矿场: 2932,
      淘金乐园: 3245,
    },
    buyPrices: {
      铁盟哨站: 2847,
    },
    buyLot: {
      铁盟哨站: 11,
    },
    type: "Special",
  },
  {
    name: "精钢",
    sellPrices: {
      修格里城: 1411,
      铁盟哨站: null,
      七号自由港: 1657,
      澄明数据中心: 1480,
      阿妮塔战备工厂: 1588,
      阿妮塔能源研究所: 1795,
      荒原站: 1411,
      曼德矿场: 1452,
      淘金乐园: 1589,
    },
    buyPrices: {
      铁盟哨站: 1370,
    },
    buyLot: {
      铁盟哨站: 17,
    },
    type: "Special",
  },
  {
    name: "桦石发财树",
    sellPrices: {
      修格里城: 5279,
      铁盟哨站: 5401,
      七号自由港: null,
      澄明数据中心: 5279,
      阿妮塔战备工厂: 5156,
      阿妮塔能源研究所: 5157,
      荒原站: 5523,
      曼德矿场: 5522,
      淘金乐园: 5792,
    },
    buyPrices: {
      七号自由港: 4888,
    },
    buyLot: {
      七号自由港: 7,
    },
    type: "Special",
  },
  {
    name: "石墨烯",
    sellPrices: {
      修格里城: 2557,
      铁盟哨站: 2964,
      七号自由港: null,
      澄明数据中心: 2627,
      阿妮塔战备工厂: 2465,
      阿妮塔能源研究所: 2534,
      荒原站: 2750,
      曼德矿场: 2810,
      淘金乐园: 2834,
    },
    buyPrices: {
      七号自由港: 2300,
    },
    buyLot: {
      七号自由港: 7,
    },
    type: "Special",
  },
  {
    name: "人工晶花",
    sellPrices: {
      修格里城: 1997,
      铁盟哨站: 2081,
      七号自由港: null,
      澄明数据中心: 1996.4,
      阿妮塔战备工厂: 1913,
      阿妮塔能源研究所: 1913,
      荒原站: 2163,
      曼德矿场: 2164,
      淘金乐园: 2301,
    },
    buyPrices: {
      七号自由港: 1777,
    },
    buyLot: {
      七号自由港: 14,
    },
    type: "Special",
  },
  {
    name: "斑节虾",
    sellPrices: {
      修格里城: 782,
      铁盟哨站: 869,
      七号自由港: null,
      澄明数据中心: 782,
      阿妮塔战备工厂: 694,
      阿妮塔能源研究所: 694,
      荒原站: 958,
      曼德矿场: 958,
      淘金乐园: 1047,
    },
    buyPrices: {
      七号自由港: 588,
    },
    buyLot: {
      七号自由港: 35,
    },
    type: "Special",
  },
  {
    name: "游戏机",
    sellPrices: {
      修格里城: 3424,
      铁盟哨站: 3424,
      七号自由港: 3552,
      澄明数据中心: null,
      阿妮塔战备工厂: 3520,
      阿妮塔能源研究所: 3775,
      荒原站: 4159,
      曼德矿场: 3648,
      淘金乐园: 3776,
    },
    buyPrices: {
      澄明数据中心: 3200,
    },
    buyLot: {
      澄明数据中心: 10,
    },
    type: "Special",
  },
  {
    name: "银矿石",
    sellPrices: {
      修格里城: 2650,
      铁盟哨站: 2650,
      七号自由港: 2725,
      澄明数据中心: null,
      阿妮塔战备工厂: 2650,
      阿妮塔能源研究所: 2875,
      荒原站: 2725,
      曼德矿场: 2725,
      淘金乐园: 2800,
    },
    buyPrices: {
      澄明数据中心: 2500,
    },
    buyLot: {
      澄明数据中心: 10,
    },
    type: "Special",
  },
  {
    name: "游戏卡带",
    sellPrices: {
      修格里城: 732.3,
      铁盟哨站: 731,
      七号自由港: 796,
      澄明数据中心: null,
      阿妮塔战备工厂: 805,
      阿妮塔能源研究所: 881,
      荒原站: 816,
      曼德矿场: 815,
      淘金乐园: 881,
    },
    buyPrices: {
      澄明数据中心: 648,
    },
    buyLot: {
      澄明数据中心: 30,
    },
    type: "Special",
  },
  {
    name: "扬声器",
    sellPrices: {
      修格里城: 1037,
      铁盟哨站: 1037,
      七号自由港: 1056,
      澄明数据中心: null,
      阿妮塔战备工厂: 1007,
      阿妮塔能源研究所: 1103,
      荒原站: 1055,
      曼德矿场: 1085,
      淘金乐园: 1133,
    },
    buyPrices: {
      澄明数据中心: 960,
    },
    buyLot: {
      澄明数据中心: 20,
    },
    type: "Special",
  },
  {
    name: "火澄石",
    sellPrices: {
      修格里城: 7560,
      铁盟哨站: 7770,
      七号自由港: 7384,
      澄明数据中心: 7385,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: 6532,
      荒原站: 7735,
      曼德矿场: 7735,
      淘金乐园: 7419,
    },
    buyPrices: {
      阿妮塔战备工厂: 7000,
    },
    buyLot: {
      阿妮塔战备工厂: 2,
    },
    type: "Special",
  },
  {
    name: "负片炮弹",
    sellPrices: {
      修格里城: 4535,
      铁盟哨站: 4663,
      七号自由港: 4431,
      澄明数据中心: 4431,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: 4430,
      荒原站: 4641,
      曼德矿场: 4641,
      淘金乐园: 4326,
    },
    buyPrices: {
      阿妮塔战备工厂: 4200,
    },
    buyLot: {
      阿妮塔战备工厂: 4,
    },
    type: "Special",
  },
  {
    name: "阿妮塔202军用无人机",
    sellPrices: {
      修格里城: 3814,
      铁盟哨站: 3920,
      七号自由港: 3710,
      澄明数据中心: 3710,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: 3710,
      荒原站: 3919,
      曼德矿场: 3920,
      淘金乐园: 3605,
    },
    buyPrices: {
      阿妮塔战备工厂: 3500,
    },
    buyLot: {
      阿妮塔战备工厂: 7,
    },
    type: "Special",
  },
  {
    name: "抗污染防护服",
    sellPrices: {
      修格里城: 3108,
      铁盟哨站: 3191,
      七号自由港: 2996,
      澄明数据中心: 3080,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: 2995,
      荒原站: 3304,
      曼德矿场: 3219,
      淘金乐园: 2967,
    },
    buyPrices: {
      阿妮塔战备工厂: 2800,
    },
    buyLot: {
      阿妮塔战备工厂: 11,
    },
    type: "Special",
  },
  {
    name: "钛合金",
    sellPrices: {
      修格里城: 2796,
      铁盟哨站: 2872,
      七号自由港: 2772,
      澄明数据中心: 2695,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: 2772,
      荒原站: 2898,
      曼德矿场: 2897,
      淘金乐园: 2596,
    },
    buyPrices: {
      阿妮塔战备工厂: 2671,
    },
    buyLot: {
      阿妮塔战备工厂: 11,
    },
    type: "Special",
  },
  {
    name: "碳纤维",
    sellPrices: {
      修格里城: 1553,
      铁盟哨站: 1596,
      七号自由港: 1498,
      澄明数据中心: 1498,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: 1540,
      荒原站: 1610,
      曼德矿场: 1610,
      淘金乐园: 1441,
    },
    buyPrices: {
      阿妮塔战备工厂: 1400,
    },
    buyLot: {
      阿妮塔战备工厂: 18,
    },
    type: "Special",
  },
  {
    name: "阿妮塔小型桦树发电机",
    sellPrices: {
      修格里城: 7852,
      铁盟哨站: 7990,
      七号自由港: 7438,
      澄明数据中心: 7715,
      阿妮塔战备工厂: 7439,
      阿妮塔能源研究所: null,
      荒原站: 7990,
      曼德矿场: 8128,
      淘金乐园: 8266,
    },
    buyPrices: {
      阿妮塔能源研究所: 6888,
    },
    buyLot: {
      阿妮塔能源研究所: 1,
    },
    type: "Special",
  },
  {
    name: "石墨烯电池",
    sellPrices: {
      修格里城: 4530,
      铁盟哨站: 4646,
      七号自由港: 4069,
      澄明数据中心: 4416,
      阿妮塔战备工厂: 4070,
      阿妮塔能源研究所: null,
      荒原站: 4531,
      曼德矿场: 4762,
      淘金乐园: 4877,
    },
    buyPrices: {
      阿妮塔能源研究所: 3840,
    },
    buyLot: {
      阿妮塔能源研究所: 8,
    },
    type: "Special",
  },
  {
    name: "阿妮塔101民用无人机",
    sellPrices: {
      修格里城: 1935,
      铁盟哨站: 2012,
      七号自由港: 1659,
      澄明数据中心: 1858,
      阿妮塔战备工厂: 1659,
      阿妮塔能源研究所: null,
      荒原站: 1966,
      曼德矿场: 2088,
      淘金乐园: 2165,
    },
    buyPrices: {
      阿妮塔能源研究所: 1535,
    },
    buyLot: {
      阿妮塔能源研究所: 14,
    },
    type: "Special",
  },
  {
    name: "家用太阳能电池组",
    sellPrices: {
      修格里城: 1452,
      铁盟哨站: 1509,
      七号自由港: 1244,
      澄明数据中心: 1394,
      阿妮塔战备工厂: 1243,
      阿妮塔能源研究所: null,
      荒原站: 1475,
      曼德矿场: 1531,
      淘金乐园: 1590,
    },
    buyPrices: {
      阿妮塔能源研究所: 1152,
    },
    buyLot: {
      阿妮塔能源研究所: 21,
    },
    type: "Special",
  },
  {
    name: "琥珀",
    sellPrices: {
      修格里城: 2419,
      铁盟哨站: 2307,
      七号自由港: 2822,
      澄明数据中心: 2598,
      阿妮塔战备工厂: 2643,
      阿妮塔能源研究所: 2867,
      荒原站: null,
      曼德矿场: 2419,
      淘金乐园: 2598,
    },
    buyPrices: {
      荒原站: 2240,
    },
    buyLot: {
      荒原站: 13,
    },
    type: "Special",
  },
  {
    name: "孔雀石",
    sellPrices: {
      修格里城: 1782,
      铁盟哨站: 1700,
      七号自由港: 2079,
      澄明数据中心: 1865,
      阿妮塔战备工厂: 1947,
      阿妮塔能源研究所: 2112,
      荒原站: null,
      曼德矿场: 1782,
      淘金乐园: 1865,
    },
    buyPrices: {
      荒原站: 1650,
    },
    buyLot: {
      荒原站: 17,
    },
    type: "Special",
  },
  {
    name: "绿松石",
    sellPrices: {
      修格里城: 1247,
      铁盟哨站: 1178,
      七号自由港: 1487,
      澄明数据中心: 1316,
      阿妮塔战备工厂: 1384,
      阿妮塔能源研究所: 1521,
      荒原站: null,
      曼德矿场: 1246,
      淘金乐园: 1316,
    },
    buyPrices: {
      荒原站: 1144,
    },
    buyLot: {
      荒原站: 19,
    },
    type: "Special",
  },
  {
    name: "棉花",
    sellPrices: {
      修格里城: 848,
      铁盟哨站: 773,
      七号自由港: 1095,
      澄明数据中心: 923,
      阿妮塔战备工厂: 1020,
      阿妮塔能源研究所: 1193,
      荒原站: null,
      曼德矿场: 848,
      淘金乐园: 945,
    },
    buyPrices: {
      荒原站: 750,
    },
    buyLot: {
      荒原站: 23,
    },
    type: "Special",
  },
  {
    name: "图形加速卡",
    sellPrices: {
      修格里城: 3409,
      铁盟哨站: 3256,
      七号自由港: 3871,
      澄明数据中心: 3564,
      阿妮塔战备工厂: 3625,
      阿妮塔能源研究所: 4085,
      荒原站: 3318,
      曼德矿场: null,
      淘金乐园: 3650,
    },
    buyPrices: {
      曼德矿场: 3071,
    },
    buyLot: {
      曼德矿场: 12,
    },
    type: "Special",
  },
  {
    name: "曼德工具箱",
    sellPrices: {
      修格里城: 1020,
      铁盟哨站: 933,
      七号自由港: 1285,
      澄明数据中心: 1109,
      阿妮塔战备工厂: 1197,
      阿妮塔能源研究所: 1460,
      荒原站: 994,
      曼德矿场: null,
      淘金乐园: 994,
    },
    buyPrices: {
      曼德矿场: 880,
    },
    buyLot: {
      曼德矿场: 27,
    },
    type: "Special",
  },
  {
    name: "沙金",
    sellPrices: {
      修格里城: 2943,
      铁盟哨站: 2943,
      七号自由港: 3185,
      澄明数据中心: 3024,
      阿妮塔战备工厂: 2781,
      阿妮塔能源研究所: 3428,
      荒原站: 2943,
      曼德矿场: 2861,
      淘金乐园: null,
    },
    buyPrices: {
      淘金乐园: 2700,
    },
    buyLot: {
      淘金乐园: 11,
    },
    type: "Special",
  },
  {
    name: "青金石",
    sellPrices: {
      修格里城: 2170,
      铁盟哨站: 2170,
      七号自由港: 2458,
      澄明数据中心: 2265,
      阿妮塔战备工厂: 1978,
      阿妮塔能源研究所: 2650,
      荒原站: 2170,
      曼德矿场: 2073,
      淘金乐园: null,
    },
    buyPrices: {
      淘金乐园: 1920,
    },
    buyLot: {
      淘金乐园: 13,
    },
    type: "Special",
  },
  {
    name: "玛瑙",
    sellPrices: {
      修格里城: 1952,
      铁盟哨站: 1952,
      七号自由港: 2212,
      澄明数据中心: 2038,
      阿妮塔战备工厂: 1780,
      阿妮塔能源研究所: 2385,
      荒原站: 1953,
      曼德矿场: 1866,
      淘金乐园: null,
    },
    buyPrices: {
      淘金乐园: 1727,
    },
    buyLot: {
      淘金乐园: 17,
    },
    type: "Special",
  },

  // CRAFT

  {
    name: "修格里严选礼包",
    buyPrices: {
      修格里城: 1688,
    },
    sellPrices: {
      修格里城: null,
      铁盟哨站: 1788,
      七号自由港: 1958,
      澄明数据中心: 1874,
      阿妮塔战备工厂: 1958,
      阿妮塔能源研究所: 2126,
      荒原站: 1874,
      曼德矿场: 1874,
      淘金乐园: 1958,
    },
    craft: {
      static: 381,
    },
    type: "Craft",
  },
  {
    name: "年货大礼包",
    buyPrices: {
      七号自由港: 3064,
    },
    sellPrices: {
      修格里城: 2688,
      铁盟哨站: 2848,
      七号自由港: null,
      澄明数据中心: 2957,
      阿妮塔战备工厂: 3064,
      阿妮塔能源研究所: 3279,
      荒原站: 2957,
      曼德矿场: 2956,
      淘金乐园: 3064,
    },
    craft: {
      static: 393,
    },
    type: "Craft",
  },
  {
    name: "金箔",
    buyPrices: {
      淘金乐园: 3000,
    },
    sellPrices: {
      修格里城: 3269,
      铁盟哨站: 3270,
      七号自由港: 3540,
      澄明数据中心: 3360,
      阿妮塔战备工厂: 3090,
      阿妮塔能源研究所: 3810,
      荒原站: 3270,
      曼德矿场: 3180,
      淘金乐园: null,
    },
    craft: {
      沙金: 0.5, // 1 沙金 = 2 金箔
    },
    type: "Craft",
  },
  {
    name: "纯金线材",
    buyPrices: {
      淘金乐园: 6300,
    },
    sellPrices: {
      修格里城: 6614,
      铁盟哨站: 6614,
      七号自由港: 7277,
      澄明数据中心: 6961,
      阿妮塔战备工厂: 6489,
      阿妮塔能源研究所: 7592,
      荒原站: 6614,
      曼德矿场: 6458,
      淘金乐园: null,
    },
    craft: {
      沙金: 0.75, // 0.75 沙金 => 1.5 金箔 => 1 纯金线材
    },
    type: "Craft",
  },

  // Normal

  {
    name: "汽配零件",
    sellPrices: {
      修格里城: null,
      铁盟哨站: 742,
      七号自由港: 822,
      澄明数据中心: 755.7,
      阿妮塔战备工厂: 792,
      阿妮塔能源研究所: 863,
      荒原站: 777,
      曼德矿场: 755,
      淘金乐园: 792,
    },
    buyPrices: {
      修格里城: 720,
    },
    buyLot: {
      修格里城: 24,
    },
    type: "Normal",
  },
  {
    name: "家电",
    sellPrices: {
      修格里城: null,
      铁盟哨站: 848,
      七号自由港: 899,
      澄明数据中心: 899,
      阿妮塔战备工厂: 899,
      阿妮塔能源研究所: 950,
      荒原站: 899,
      曼德矿场: 872,
      淘金乐园: 923,
    },
    buyPrices: {
      修格里城: 848,
    },
    buyLot: {
      修格里城: 21,
    },
    type: "Normal",
  },
  {
    name: "罐头",
    sellPrices: {
      修格里城: null,
      铁盟哨站: 108,
      七号自由港: 116,
      澄明数据中心: 113.4,
      阿妮塔战备工厂: 116,
      阿妮塔能源研究所: 129,
      荒原站: 110,
      曼德矿场: 112,
      淘金乐园: 119,
    },
    buyPrices: {
      修格里城: 105,
    },
    buyLot: {
      修格里城: 45,
    },
    type: "Normal",
  },
  {
    name: "沃德山泉",
    sellPrices: {
      修格里城: null,
      铁盟哨站: 52,
      七号自由港: 69,
      澄明数据中心: 62,
      阿妮塔战备工厂: 69,
      阿妮塔能源研究所: 89,
      荒原站: 60,
      曼德矿场: 60,
      淘金乐园: 69,
    },
    buyPrices: {
      修格里城: 50,
    },
    buyLot: {
      修格里城: 60,
    },
    type: "Normal",
  },
  {
    name: "高档餐具",
    sellPrices: {
      修格里城: null,
      铁盟哨站: 368,
      七号自由港: 397,
      澄明数据中心: 383.3,
      阿妮塔战备工厂: 396,
      阿妮塔能源研究所: 426,
      荒原站: 383,
      曼德矿场: 383,
      淘金乐园: 397,
    },
    buyPrices: {
      修格里城: 368,
    },
    buyLot: {
      修格里城: 35,
    },
    type: "Normal",
  },
  {
    name: "炮弹",
    sellPrices: {
      修格里城: 1796,
      铁盟哨站: null,
      七号自由港: 1914,
      澄明数据中心: 1813,
      阿妮塔战备工厂: 1915,
      阿妮塔能源研究所: 2017,
      荒原站: 1761,
      曼德矿场: 1761,
      淘金乐园: 1864,
    },
    buyPrices: {
      铁盟哨站: 1710,
    },
    buyLot: {
      铁盟哨站: 15,
    },
    type: "Normal",
  },
  {
    name: "塑胶炸药",
    sellPrices: {
      修格里城: 827,
      铁盟哨站: null,
      七号自由港: 951,
      澄明数据中心: 885,
      阿妮塔战备工厂: 943,
      阿妮塔能源研究所: 1016,
      荒原站: 852,
      曼德矿场: 852,
      淘金乐园: 943,
    },
    buyPrices: {
      铁盟哨站: 827,
    },
    buyLot: {
      铁盟哨站: 20,
    },
    type: "Normal",
  },
  {
    name: "子弹",
    sellPrices: {
      修格里城: 677,
      铁盟哨站: null,
      七号自由港: 757,
      澄明数据中心: 717,
      阿妮塔战备工厂: 758,
      阿妮塔能源研究所: 799,
      荒原站: 697,
      曼德矿场: 696,
      淘金乐园: 757,
    },
    buyPrices: {
      铁盟哨站: 677,
    },
    buyLot: {
      铁盟哨站: 20,
    },
    type: "Normal",
  },
  {
    name: "汽油",
    sellPrices: {
      修格里城: 587,
      铁盟哨站: null,
      七号自由港: 656,
      澄明数据中心: 603,
      阿妮塔战备工厂: 637,
      阿妮塔能源研究所: 690,
      荒原站: 586,
      曼德矿场: 587,
      淘金乐园: 638,
    },
    buyPrices: {
      铁盟哨站: 570,
    },
    buyLot: {
      铁盟哨站: 27,
    },
    type: "Normal",
  },
  {
    name: "靛红五月军用食品",
    sellPrices: {
      修格里城: 181,
      铁盟哨站: null,
      七号自由港: 204,
      澄明数据中心: 190,
      阿妮塔战备工厂: 200,
      阿妮塔能源研究所: 227,
      荒原站: 177,
      曼德矿场: 177,
      淘金乐园: 195,
    },
    buyPrices: {
      铁盟哨站: 177,
    },
    buyLot: {
      铁盟哨站: 47,
    },
    type: "Normal",
  },
  {
    name: "电子配件",
    sellPrices: {
      修格里城: 1137,
      铁盟哨站: 1211,
      七号自由港: null,
      澄明数据中心: 1167,
      阿妮塔战备工厂: 1095,
      阿妮塔能源研究所: 1096,
      荒原站: 1219,
      曼德矿场: 1249,
      淘金乐园: 1260,
    },
    buyPrices: {
      七号自由港: 1024,
    },
    buyLot: {
      七号自由港: 21,
    },
    type: "Normal",
  },
  {
    name: "航天纪念品",
    sellPrices: {
      修格里城: 862,
      铁盟哨站: 894,
      七号自由港: null,
      澄明数据中心: 861.7,
      阿妮塔战备工厂: 808,
      阿妮塔能源研究所: 807,
      荒原站: 901,
      曼德矿场: 924,
      淘金乐园: 932,
    },
    buyPrices: {
      七号自由港: 777,
    },
    buyLot: {
      七号自由港: 28,
    },
    type: "Normal",
  },
  {
    name: "坚果",
    sellPrices: {
      修格里城: 237.5,
      铁盟哨站: 254,
      七号自由港: null,
      澄明数据中心: 237.2,
      阿妮塔战备工厂: 220,
      阿妮塔能源研究所: 221,
      荒原站: 252,
      曼德矿场: 265,
      淘金乐园: 275,
    },
    buyPrices: {
      七号自由港: 210,
    },
    buyLot: {
      七号自由港: 42,
    },
    type: "Normal",
  },
  {
    name: "啤酒",
    sellPrices: {
      修格里城: 132.5,
      铁盟哨站: 145,
      七号自由港: null,
      澄明数据中心: 133,
      阿妮塔战备工厂: 124,
      阿妮塔能源研究所: 126,
      荒原站: 142,
      曼德矿场: 149,
      淘金乐园: 148,
    },
    buyPrices: {
      七号自由港: 117,
    },
    buyLot: {
      七号自由港: 56,
    },
    type: "Normal",
  },
  {
    name: "海盐",
    sellPrices: {
      修格里城: 99,
      铁盟哨站: 104,
      七号自由港: null,
      澄明数据中心: 101,
      阿妮塔战备工厂: 92,
      阿妮塔能源研究所: 92,
      荒原站: 108,
      曼德矿场: 109,
      淘金乐园: 113,
    },
    buyPrices: {
      七号自由港: 88,
    },
    buyLot: {
      七号自由港: 70,
    },
    type: "Normal",
  },
  {
    name: "录像带",
    sellPrices: {
      修格里城: 543,
      铁盟哨站: 543,
      七号自由港: 543,
      澄明数据中心: null,
      阿妮塔战备工厂: 527,
      阿妮塔能源研究所: 558,
      荒原站: 542,
      曼德矿场: 542,
      淘金乐园: 558,
    },
    buyPrices: {
      澄明数据中心: 512,
    },
    buyLot: {
      澄明数据中心: 30,
    },
    type: "Normal",
  },
  {
    name: "荧光棒",
    sellPrices: {
      修格里城: 448.6,
      铁盟哨站: 449,
      七号自由港: 470,
      澄明数据中心: null,
      阿妮塔战备工厂: 437,
      阿妮塔能源研究所: 478,
      荒原站: 458,
      曼德矿场: 469,
      淘金乐园: 477,
    },
    buyPrices: {
      澄明数据中心: 416,
    },
    buyLot: {
      澄明数据中心: 35,
    },
    type: "Normal",
  },
  {
    name: "火车玩具",
    sellPrices: {
      修格里城: 336,
      铁盟哨站: 336,
      七号自由港: 361,
      澄明数据中心: null,
      阿妮塔战备工厂: 336,
      阿妮塔能源研究所: 368,
      荒原站: 352,
      曼德矿场: 362,
      淘金乐园: 378,
    },
    buyPrices: {
      澄明数据中心: 320,
    },
    buyLot: {
      澄明数据中心: 40,
    },
    type: "Normal",
  },
  {
    name: "录音带",
    sellPrices: {
      修格里城: 359,
      铁盟哨站: 271,
      七号自由港: 271,
      澄明数据中心: null,
      阿妮塔战备工厂: 264,
      阿妮塔能源研究所: 279,
      荒原站: 271,
      曼德矿场: 271,
      淘金乐园: 279,
    },
    buyPrices: {
      澄明数据中心: 256,
    },
    buyLot: {
      澄明数据中心: 50,
    },
    type: "Normal",
  },
  {
    name: "形态共振瞄准器",
    sellPrices: {
      修格里城: 1155,
      铁盟哨站: 1187,
      七号自由港: 1103,
      澄明数据中心: 1103,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: 1103,
      荒原站: 1239,
      曼德矿场: 1208,
      淘金乐园: 1082,
    },
    buyPrices: {
      阿妮塔战备工厂: 1050,
    },
    buyLot: {
      阿妮塔战备工厂: 18,
    },
    type: "Normal",
  },
  {
    name: "高导磁硅钢片",
    sellPrices: {
      修格里城: 949,
      铁盟哨站: 948,
      七号自由港: 906,
      澄明数据中心: 907,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: 907,
      荒原站: 966,
      曼德矿场: 1016,
      淘金乐园: 865,
    },
    buyPrices: {
      阿妮塔战备工厂: 839,
    },
    buyLot: {
      阿妮塔战备工厂: 29,
    },
    type: "Normal",
  },
  {
    name: "黄铜线圈",
    sellPrices: {
      修格里城: 791,
      铁盟哨站: 770,
      七号自由港: 756,
      澄明数据中心: 756,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: 755,
      荒原站: 804,
      曼德矿场: 805,
      淘金乐园: 700,
    },
    buyPrices: {
      阿妮塔战备工厂: 700,
    },
    buyLot: {
      阿妮塔战备工厂: 47,
    },
    type: "Normal",
  },
  {
    name: "锂电池",
    sellPrices: {
      修格里城: 890,
      铁盟哨站: 944,
      七号自由港: 822,
      澄明数据中心: 905,
      阿妮塔战备工厂: 799,
      阿妮塔能源研究所: null,
      荒原站: 921,
      曼德矿场: 951,
      淘金乐园: 1006,
    },
    buyPrices: {
      阿妮塔能源研究所: 767,
    },
    buyLot: {
      阿妮塔能源研究所: 28,
    },
    type: "Normal",
  },
  {
    name: "充电电池",
    sellPrices: {
      修格里城: 333,
      铁盟哨站: 354,
      七号自由港: 307,
      澄明数据中心: 340,
      阿妮塔战备工厂: 300,
      阿妮塔能源研究所: null,
      荒原站: 346,
      曼德矿场: 356,
      淘金乐园: 377,
    },
    buyPrices: {
      阿妮塔能源研究所: 288,
    },
    buyLot: {
      阿妮塔能源研究所: 42,
    },
    type: "Normal",
  },
  {
    name: "铅矿石",
    sellPrices: {
      修格里城: 719,
      铁盟哨站: 698,
      七号自由港: 779,
      澄明数据中心: 738,
      阿妮塔战备工厂: 759,
      阿妮塔能源研究所: 819,
      荒原站: null,
      曼德矿场: 697,
      淘金乐园: 738,
    },
    buyPrices: {
      荒原站: 677,
    },
    buyLot: {
      荒原站: 29,
    },
    type: "Normal",
  },
  {
    name: "石墨",
    sellPrices: {
      修格里城: 407,
      铁盟哨站: 396,
      七号自由港: 452,
      澄明数据中心: 419,
      阿妮塔战备工厂: 430,
      阿妮塔能源研究所: 465,
      荒原站: null,
      曼德矿场: 395,
      淘金乐园: 418,
    },
    buyPrices: {
      荒原站: 384,
    },
    buyLot: {
      荒原站: 39,
    },
    type: "Normal",
  },
  {
    name: "土豆",
    sellPrices: {
      修格里城: 66,
      铁盟哨站: 63,
      七号自由港: 82,
      澄明数据中心: 72,
      阿妮塔战备工厂: 76,
      阿妮塔能源研究所: 87,
      荒原站: null,
      曼德矿场: 66,
      淘金乐园: 70,
    },
    buyPrices: {
      荒原站: 61,
    },
    buyLot: {
      荒原站: 53,
    },
    type: "Normal",
  },
  {
    name: "钛矿石",
    sellPrices: {
      修格里城: 1750,
      铁盟哨站: 1716,
      七号自由港: 2041,
      澄明数据中心: 1830,
      阿妮塔战备工厂: 1959,
      阿妮塔能源研究所: 2202,
      荒原站: 1750,
      曼德矿场: null,
      淘金乐园: 1750,
    },
    buyPrices: {
      曼德矿场: 1619,
    },
    buyLot: {
      曼德矿场: 15,
    },
    type: "Normal",
  },
  {
    name: "铁轨用特种钢材",
    sellPrices: {
      修格里城: 1166,
      铁盟哨站: 1112,
      七号自由港: 1328,
      澄明数据中心: 1219,
      阿妮塔战备工厂: 1273,
      阿妮塔能源研究所: 1436,
      荒原站: 1166,
      曼德矿场: null,
      淘金乐园: 1166,
    },
    buyPrices: {
      曼德矿场: 1079,
    },
    buyLot: {
      曼德矿场: 24,
    },
    type: "Normal",
  },
  {
    name: "黄铜",
    sellPrices: {
      修格里城: 657,
      铁盟哨站: 638,
      七号自由港: 694,
      澄明数据中心: 675,
      阿妮塔战备工厂: 694,
      阿妮塔能源研究所: 750,
      荒原站: 638,
      曼德矿场: null,
      淘金乐园: 638,
    },
    buyPrices: {
      曼德矿场: 619,
    },
    buyLot: {
      曼德矿场: 30,
    },
    type: "Normal",
  },
  {
    name: "钢筋混凝土轨枕",
    sellPrices: {
      修格里城: 583,
      铁盟哨站: 555,
      七号自由港: 664,
      澄明数据中心: 610,
      阿妮塔战备工厂: 637,
      阿妮塔能源研究所: 718,
      荒原站: 583,
      曼德矿场: null,
      淘金乐园: 583,
    },
    buyPrices: {
      曼德矿场: 539,
    },
    buyLot: {
      曼德矿场: 36,
    },
    type: "Normal",
  },
  {
    name: "建材",
    sellPrices: {
      修格里城: 524,
      铁盟哨站: 463,
      七号自由港: 521,
      澄明数据中心: 500,
      阿妮塔战备工厂: 504,
      阿妮塔能源研究所: 572,
      荒原站: 482,
      曼德矿场: null,
      淘金乐园: 467,
    },
    buyPrices: {
      曼德矿场: 450,
    },
    buyLot: {
      曼德矿场: 30,
    },
    type: "Normal",
  },
  {
    name: "石材",
    sellPrices: {
      修格里城: 188,
      铁盟哨站: 179,
      七号自由港: 216,
      澄明数据中心: 202,
      阿妮塔战备工厂: 207,
      阿妮塔能源研究所: 234,
      荒原站: 188,
      曼德矿场: null,
      淘金乐园: 189,
    },
    buyPrices: {
      曼德矿场: 179,
    },
    buyLot: {
      曼德矿场: 45,
    },
    type: "Normal",
  },
  {
    name: "砂石",
    sellPrices: {
      修格里城: 28,
      铁盟哨站: 30,
      七号自由港: 35,
      澄明数据中心: 33,
      阿妮塔战备工厂: 35,
      阿妮塔能源研究所: 39,
      荒原站: 32,
      曼德矿场: null,
      淘金乐园: 32,
    },
    buyPrices: {
      曼德矿场: 29,
    },
    buyLot: {
      曼德矿场: 72,
    },
    type: "Normal",
  },
  {
    name: "漆黑矿渣",
    sellPrices: {
      修格里城: 621,
      铁盟哨站: 654,
      七号自由港: 738,
      澄明数据中心: 672,
      阿妮塔战备工厂: 571,
      阿妮塔能源研究所: 805,
      荒原站: 621,
      曼德矿场: 588,
      淘金乐园: null,
    },
    buyPrices: {
      淘金乐园: 554,
    },
    buyLot: {
      淘金乐园: 37,
    },
    type: "Normal",
  },
  {
    name: "铁矿石",
    sellPrices: {
      修格里城: 361,
      铁盟哨站: 361,
      七号自由港: 392,
      澄明数据中心: 370,
      阿妮塔战备工厂: 392,
      阿妮塔能源研究所: 423,
      荒原站: 360,
      曼德矿场: null,
      淘金乐园: null,
    },
    buyPrices: {
      曼德矿场: 350,
      淘金乐园: 333,
    },
    buyLot: {
      曼德矿场: 36,
      淘金乐园: 41,
    },
    type: "Normal",
  },
  {
    name: "石英矿",
    sellPrices: {
      修格里城: 266,
      铁盟哨站: 273,
      七号自由港: 321,
      澄明数据中心: 288,
      阿妮塔战备工厂: 233,
      阿妮塔能源研究所: 347,
      荒原站: 266,
      曼德矿场: 249,
      淘金乐园: null,
    },
    buyPrices: {
      淘金乐园: 232,
    },
    buyLot: {
      淘金乐园: 47,
    },
    type: "Normal",
  },
];

export const PRODUCTS: Product[] = pdts.filter((product) => {
  // exclude low buy price Normal products
  if (product.type === "Normal") {
    if (product.buyPrices) {
      const buyPrices = Object.values(product.buyPrices).filter((price) => price !== null) as number[];
      if (buyPrices.length === 0) {
        return false;
      }
      if (Math.min(...buyPrices) < 300) {
        return false;
      }
    }
  }
  return true;
});

/*
// csv to json

pdts.map((p) => {
    const buyPrices = {}
    const sellPrices = {}
    const buyLot = {}
    buyPrices[p["产地"]] = p["基准价格"]
    buyLot[p["产地"]] = p["基础货量"]

    for (const c of cityList) {
        if (p[c]) {
            sellPrices[c] = p[c]
        } else {
            sellPrices[c] = null
        }
    }

    return {
        name: p["商品"],
        sellPrices,
        buyPrices,
        buyLot,
        type: "Normal",
    }
})
*/
