import { Product } from "@/interfaces/product";

export const PRODUCTS: Product[] = [
  {
    name: "发动机",
    sellPrices: {
      修格里城: null,
      铁盟哨站: 3464,
      七号自由港: 3665,
      澄明数据中心: 3565,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: 3968,
      荒原站: 3565,
      曼德矿场: 3565,
      淘金乐园: 3767,
    },
    buyPrices: {
      修格里城: 3363,
    },
    buyLot: {
      修格里城: 9,
    },
    type: "Special",
  },
  {
    name: "弹丸加速装置",
    sellPrices: {
      修格里城: null,
      铁盟哨站: null,
      七号自由港: 2383,
      澄明数据中心: 2297,
      阿妮塔战备工厂: 2448,
      阿妮塔能源研究所: 2555,
      荒原站: 2297,
      曼德矿场: 2296,
      淘金乐园: 2448,
    },
    buyPrices: {
      修格里城: 2147,
      铁盟哨站: 2067,
    },
    buyLot: {
      修格里城: 18,
      铁盟哨站: 12,
    },
    type: "Special",
  },
  {
    name: "红茶",
    sellPrices: {
      修格里城: null,
      铁盟哨站: 709,
      七号自由港: 873,
      澄明数据中心: 790,
      阿妮塔战备工厂: 873,
      阿妮塔能源研究所: 1039,
      荒原站: 790,
      曼德矿场: 791,
      淘金乐园: 873,
    },
    buyPrices: {
      修格里城: 688,
    },
    buyLot: {
      修格里城: 29,
    },
    type: "Special",
  },
  {
    name: "沃德烤鸡",
    sellPrices: {
      修格里城: null,
      铁盟哨站: 316,
      七号自由港: 464,
      澄明数据中心: 381.3,
      阿妮塔战备工厂: 456,
      阿妮塔能源研究所: 613,
      荒原站: 381,
      曼德矿场: 390,
      淘金乐园: 464,
    },
    buyPrices: {
      修格里城: 300,
    },
    buyLot: {
      修格里城: 39,
    },
    type: "Special",
  },
  {
    name: "防弹背心",
    sellPrices: {
      修格里城: null,
      铁盟哨站: null,
      七号自由港: 3359,
      澄明数据中心: null,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: 3586,
      荒原站: 2932,
      曼德矿场: 2932,
      淘金乐园: 3245,
    },
    buyPrices: {
      铁盟哨站: 2847,
    },
    buyLot: {
      铁盟哨站: 11,
    },
    type: "Special",
  },
  {
    name: "精钢",
    sellPrices: {
      修格里城: 1411,
      铁盟哨站: null,
      七号自由港: 1657,
      澄明数据中心: 1480,
      阿妮塔战备工厂: 1588,
      阿妮塔能源研究所: 1795,
      荒原站: 1411,
      曼德矿场: 1452,
      淘金乐园: 1589,
    },
    buyPrices: {
      铁盟哨站: 1370,
    },
    buyLot: {
      铁盟哨站: 17,
    },
    type: "Special",
  },
  {
    name: "桦石发财树",
    sellPrices: {
      修格里城: 5279,
      铁盟哨站: 5401,
      七号自由港: null,
      澄明数据中心: 5279,
      阿妮塔战备工厂: 5156,
      阿妮塔能源研究所: 5157,
      荒原站: 5523,
      曼德矿场: 5522,
      淘金乐园: 5792,
    },
    buyPrices: {
      七号自由港: 4888,
    },
    buyLot: {
      七号自由港: 7,
    },
    type: "Special",
  },
  {
    name: "石墨烯",
    sellPrices: {
      修格里城: 2557,
      铁盟哨站: null,
      七号自由港: null,
      澄明数据中心: null,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: 2534,
      荒原站: 2750,
      曼德矿场: 2810,
      淘金乐园: 2834,
    },
    buyPrices: {
      七号自由港: 2300,
    },
    buyLot: {
      七号自由港: 10,
    },
    type: "Special",
  },
  {
    name: "人工晶花",
    sellPrices: {
      修格里城: 1997,
      铁盟哨站: 2081,
      七号自由港: null,
      澄明数据中心: 1996.4,
      阿妮塔战备工厂: 1913,
      阿妮塔能源研究所: 1913,
      荒原站: 2163,
      曼德矿场: 2164,
      淘金乐园: 2301,
    },
    buyPrices: {
      七号自由港: 1777,
    },
    buyLot: {
      七号自由港: 16,
    },
    type: "Special",
  },
  {
    name: "班节虾",
    sellPrices: {
      修格里城: 782,
      铁盟哨站: 869,
      七号自由港: null,
      澄明数据中心: 782,
      阿妮塔战备工厂: 694,
      阿妮塔能源研究所: 694,
      荒原站: 958,
      曼德矿场: 958,
      淘金乐园: 1047,
    },
    buyPrices: {
      七号自由港: 588,
    },
    buyLot: {
      七号自由港: 35,
    },
    type: "Special",
  },
  {
    name: "游戏机",
    sellPrices: {
      修格里城: 3424,
      铁盟哨站: 3424,
      七号自由港: 3552,
      澄明数据中心: null,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: null,
      荒原站: null,
      曼德矿场: null,
      淘金乐园: null,
    },
    buyPrices: {
      澄明数据中心: 3200,
    },
    buyLot: {
      澄明数据中心: 10,
    },
    type: "Special",
  },
  {
    name: "银矿石",
    sellPrices: {
      修格里城: 2650,
      铁盟哨站: 2650,
      七号自由港: 2725,
      澄明数据中心: null,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: null,
      荒原站: null,
      曼德矿场: null,
      淘金乐园: null,
    },
    buyPrices: {
      澄明数据中心: 2500,
    },
    buyLot: {
      澄明数据中心: 10,
    },
    type: "Special",
  },
  {
    name: "游戏卡带",
    sellPrices: {
      修格里城: 732.3,
      铁盟哨站: 731,
      七号自由港: 796,
      澄明数据中心: null,
      阿妮塔战备工厂: 805,
      阿妮塔能源研究所: 881,
      荒原站: 816,
      曼德矿场: 815,
      淘金乐园: 881,
    },
    buyPrices: {
      澄明数据中心: 648,
    },
    buyLot: {
      澄明数据中心: 30,
    },
    type: "Special",
  },
  {
    name: "扬声器",
    sellPrices: {
      修格里城: 1037,
      铁盟哨站: 1037,
      七号自由港: 1056,
      澄明数据中心: null,
      阿妮塔战备工厂: 1007,
      阿妮塔能源研究所: 1103,
      荒原站: 1055,
      曼德矿场: 1085,
      淘金乐园: 1133,
    },
    buyPrices: {
      澄明数据中心: 960,
    },
    buyLot: {
      澄明数据中心: 20,
    },
    type: "Special",
  },
  {
    name: "火澄石",
    sellPrices: {
      修格里城: 7560,
      铁盟哨站: 7770,
      七号自由港: 7384,
      澄明数据中心: 7385,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: null,
      荒原站: 7735,
      曼德矿场: 7735,
      淘金乐园: 7419,
    },
    buyPrices: {
      阿妮塔战备工厂: 7000,
    },
    buyLot: {
      阿妮塔战备工厂: 2,
    },
    type: "Special",
  },
  {
    name: "负片炮弹",
    sellPrices: {
      修格里城: null,
      铁盟哨站: null,
      七号自由港: null,
      澄明数据中心: null,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: 4430,
      荒原站: 4641,
      曼德矿场: 4641,
      淘金乐园: 4326,
    },
    buyPrices: {
      阿妮塔战备工厂: 4200,
    },
    buyLot: {
      阿妮塔战备工厂: 4,
    },
    type: "Special",
  },
  {
    name: "阿妮塔202军用无人机",
    sellPrices: {
      修格里城: 3814,
      铁盟哨站: 3920,
      七号自由港: 3710,
      澄明数据中心: 3710,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: 3710,
      荒原站: 3919,
      曼德矿场: 3920,
      淘金乐园: 3605,
    },
    buyPrices: {
      阿妮塔战备工厂: 3500,
    },
    buyLot: {
      阿妮塔战备工厂: 7,
    },
    type: "Special",
  },
  {
    name: "抗污染防护服",
    sellPrices: {
      修格里城: 3108,
      铁盟哨站: 3191,
      七号自由港: 2996,
      澄明数据中心: 3080,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: 2995,
      荒原站: 3304,
      曼德矿场: 3219,
      淘金乐园: 2967,
    },
    buyPrices: {
      阿妮塔战备工厂: 2800,
    },
    buyLot: {
      阿妮塔战备工厂: 11,
    },
    type: "Special",
  },
  {
    name: "钛合金",
    sellPrices: {
      修格里城: 2796,
      铁盟哨站: 2872,
      七号自由港: 2772,
      澄明数据中心: 2695,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: 2772,
      荒原站: 2898,
      曼德矿场: 2897,
      淘金乐园: 2596,
    },
    buyPrices: {
      阿妮塔战备工厂: 2671,
    },
    buyLot: {
      阿妮塔战备工厂: 11,
    },
    type: "Special",
  },
  {
    name: "碳纤维",
    sellPrices: {
      修格里城: 1553,
      铁盟哨站: 1596,
      七号自由港: 1498,
      澄明数据中心: 1498,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: 1540,
      荒原站: 1610,
      曼德矿场: 1610,
      淘金乐园: 1441,
    },
    buyPrices: {
      阿妮塔战备工厂: 1400,
    },
    buyLot: {
      阿妮塔战备工厂: 18,
    },
    type: "Special",
  },
  {
    name: "阿妮塔小型桦树发电机",
    sellPrices: {
      修格里城: null,
      铁盟哨站: null,
      七号自由港: 7438,
      澄明数据中心: null,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: null,
      荒原站: null,
      曼德矿场: 8128,
      淘金乐园: 8266,
    },
    buyPrices: {
      阿妮塔能源研究所: 6888,
    },
    buyLot: {
      阿妮塔能源研究所: 1,
    },
    type: "Special",
  },
  {
    name: "石墨烯电池",
    sellPrices: {
      修格里城: null,
      铁盟哨站: null,
      七号自由港: 4069,
      澄明数据中心: null,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: null,
      荒原站: null,
      曼德矿场: 4762,
      淘金乐园: 4877,
    },
    buyPrices: {
      阿妮塔能源研究所: 3840,
    },
    buyLot: {
      阿妮塔能源研究所: 8,
    },
    type: "Special",
  },
  {
    name: "阿妮塔101民用无人机",
    sellPrices: {
      修格里城: 1935,
      铁盟哨站: 2012,
      七号自由港: 1659,
      澄明数据中心: 1858,
      阿妮塔战备工厂: 1659,
      阿妮塔能源研究所: null,
      荒原站: 1966,
      曼德矿场: 2088,
      淘金乐园: 2165,
    },
    buyPrices: {
      阿妮塔能源研究所: 1535,
    },
    buyLot: {
      阿妮塔能源研究所: 14,
    },
    type: "Special",
  },
  {
    name: "家用太阳能电池组",
    sellPrices: {
      修格里城: 1452,
      铁盟哨站: 1509,
      七号自由港: 1244,
      澄明数据中心: 1394,
      阿妮塔战备工厂: 1243,
      阿妮塔能源研究所: null,
      荒原站: 1475,
      曼德矿场: 1531,
      淘金乐园: 1590,
    },
    buyPrices: {
      阿妮塔能源研究所: 1152,
    },
    buyLot: {
      阿妮塔能源研究所: 21,
    },
    type: "Special",
  },
  {
    name: "琥珀",
    sellPrices: {
      修格里城: 2419,
      铁盟哨站: 2307,
      七号自由港: 2822,
      澄明数据中心: 2598,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: 2867,
      荒原站: null,
      曼德矿场: 2419,
      淘金乐园: 2598,
    },
    buyPrices: {
      荒原站: 2240,
    },
    buyLot: {
      荒原站: 23,
    },
    type: "Special",
  },
  {
    name: "孔雀石",
    sellPrices: {
      修格里城: 1782,
      铁盟哨站: 1700,
      七号自由港: 2079,
      澄明数据中心: 1865,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: 2112,
      荒原站: null,
      曼德矿场: 1782,
      淘金乐园: 1865,
    },
    buyPrices: {
      荒原站: 1337,
    },
    buyLot: {
      荒原站: 31,
    },
    type: "Special",
  },
  {
    name: "绿松石",
    sellPrices: {
      修格里城: 1247,
      铁盟哨站: 1178,
      七号自由港: 1487,
      澄明数据中心: 1316,
      阿妮塔战备工厂: 1384,
      阿妮塔能源研究所: 1521,
      荒原站: null,
      曼德矿场: 1246,
      淘金乐园: 1316,
    },
    buyPrices: {
      荒原站: 1144,
    },
    buyLot: {
      荒原站: 19,
    },
    type: "Special",
  },
  {
    name: "图形加速卡",
    sellPrices: {
      修格里城: 3409,
      铁盟哨站: 3256,
      七号自由港: 3871,
      澄明数据中心: 3564,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: 4085,
      荒原站: 3318,
      曼德矿场: null,
      淘金乐园: 3650,
    },
    buyPrices: {
      曼德矿场: 3071,
    },
    buyLot: {
      曼德矿场: 17,
    },
    type: "Special",
  },
  {
    name: "曼德工具箱",
    sellPrices: {
      修格里城: 1020,
      铁盟哨站: 933,
      七号自由港: 1285,
      澄明数据中心: 1109,
      阿妮塔战备工厂: 1197,
      阿妮塔能源研究所: 1460,
      荒原站: 994,
      曼德矿场: null,
      淘金乐园: 994,
    },
    buyPrices: {
      曼德矿场: 880,
    },
    buyLot: {
      曼德矿场: 27,
    },
    type: "Special",
  },
  {
    name: "钛矿石",
    sellPrices: {
      修格里城: 1750,
      铁盟哨站: 1716,
      七号自由港: 2041,
      澄明数据中心: 1830,
      阿妮塔战备工厂: 1959,
      阿妮塔能源研究所: 2202,
      荒原站: 1750,
      曼德矿场: null,
      淘金乐园: 1750,
    },
    buyPrices: {
      曼德矿场: 1619,
    },
    buyLot: {
      曼德矿场: 15,
    },
    type: "Normal",
  },
  {
    name: "铁轨用特种钢材",
    sellPrices: {
      修格里城: 1166,
      铁盟哨站: 1112,
      七号自由港: 1328,
      澄明数据中心: 1219,
      阿妮塔战备工厂: 1273,
      阿妮塔能源研究所: 1436,
      荒原站: 1166,
      曼德矿场: null,
      淘金乐园: 1166,
    },
    buyPrices: {
      曼德矿场: 1079,
    },
    buyLot: {
      曼德矿场: 24,
    },
    type: "Normal",
  },
  {
    name: "沙金",
    sellPrices: {
      修格里城: 2943,
      铁盟哨站: 2943,
      七号自由港: 3185,
      澄明数据中心: 3024,
      阿妮塔战备工厂: 2781,
      阿妮塔能源研究所: 3428,
      荒原站: 2943,
      曼德矿场: 2861,
      淘金乐园: null,
    },
    buyPrices: {
      淘金乐园: 2700,
    },
    buyLot: {
      淘金乐园: 11,
    },
    type: "Special",
  },
  {
    name: "青金石",
    sellPrices: {
      修格里城: 2170,
      铁盟哨站: 2170,
      七号自由港: 2458,
      澄明数据中心: 2265,
      阿妮塔战备工厂: 1978,
      阿妮塔能源研究所: 2650,
      荒原站: 2170,
      曼德矿场: 2073,
      淘金乐园: null,
    },
    buyPrices: {
      淘金乐园: 1920,
    },
    buyLot: {
      淘金乐园: 13,
    },
    type: "Special",
  },
  {
    name: "玛瑙",
    sellPrices: {
      修格里城: 1952,
      铁盟哨站: 1952,
      七号自由港: 2212,
      澄明数据中心: 2038,
      阿妮塔战备工厂: 1780,
      阿妮塔能源研究所: 2385,
      荒原站: 1953,
      曼德矿场: 1866,
      淘金乐园: null,
    },
    buyPrices: {
      淘金乐园: 1727,
    },
    buyLot: {
      淘金乐园: 17,
    },
    type: "Special",
  },

  // CRAFT

  {
    name: "修格里严选礼包",
    buyPrices: {
      修格里城: 1688,
    },
    sellPrices: {
      修格里城: null,
      铁盟哨站: 1788,
      七号自由港: 1958,
      澄明数据中心: 1874,
      阿妮塔战备工厂: 1958,
      阿妮塔能源研究所: 2126,
      荒原站: 1874,
      曼德矿场: 1874,
      淘金乐园: 1958,
    },
    craft: {
      static: 381,
    },
    type: "Craft",
  },
  {
    name: "年货大礼包",
    buyPrices: {
      七号自由港: 3064,
    },
    sellPrices: {
      修格里城: 2688,
      铁盟哨站: 2848,
      七号自由港: null,
      澄明数据中心: 2957,
      阿妮塔战备工厂: 3064,
      阿妮塔能源研究所: 3279,
      荒原站: 2957,
      曼德矿场: 2956,
      淘金乐园: 3064,
    },
    craft: {
      static: 393,
    },
    type: "Craft",
  },
  {
    name: "金箔",
    buyPrices: {
      淘金乐园: 3000,
    },
    sellPrices: {
      修格里城: 3269,
      铁盟哨站: null,
      七号自由港: 3540,
      澄明数据中心: 3360,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: 3810,
      荒原站: 3270,
      曼德矿场: 3180,
      淘金乐园: null,
    },
    craft: {
      沙金: 0.5, // 1 沙金 = 2 金箔
    },
    type: "Craft",
  },
  {
    name: "纯金线材",
    buyPrices: {
      淘金乐园: 6300,
    },
    sellPrices: {
      修格里城: 6614,
      铁盟哨站: null,
      七号自由港: 7277,
      澄明数据中心: 6961,
      阿妮塔战备工厂: null,
      阿妮塔能源研究所: 7592,
      荒原站: 6614,
      曼德矿场: 6458,
      淘金乐园: null,
    },
    craft: {
      沙金: 3, // 3 沙金 => 1.5 金箔 => 1 纯金线材
    },
    type: "Craft",
  },
];
